#### Terraform Tfsec 🤖`success'
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.this-s3-bucket: Refreshing state... [id=caw-aws-aps1-prod-s3-terraform-demo-demo-bucket-aayush]
data.aws_cloudfront_cache_policy.cache_policy_cloudfront: Reading...
data.aws_canonical_user_id.current: Reading...
data.aws_cloudfront_cache_policy.cache_policy_cloudfront: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_canonical_user_id.current: Read complete after 1s [id=7b24440f1a114a6facb2373de7b91fc2957ca21eb08c8a1f618f6529fd5a9a00]
aws_s3_bucket_acl.this-s3-acl_policy: Refreshing state... [id=caw-aws-aps1-prod-s3-terraform-demo-demo-bucket-aayush]
aws_s3_bucket_website_configuration.this-s3-website-configuration: Refreshing state... [id=caw-aws-aps1-prod-s3-terraform-demo-demo-bucket-aayush]
aws_s3_bucket_policy.this-s3-policy: Refreshing state... [id=caw-aws-aps1-prod-s3-terraform-demo-demo-bucket-aayush]
data.aws_s3_bucket.demo-portal-s3-bucket: Reading...
data.aws_s3_bucket.demo-portal-s3-bucket: Read complete after 1s [id=caw-aws-aps1-prod-s3-terraform-demo-demo-bucket-aayush]
aws_cloudfront_distribution.this-cdn-portal: Refreshing state... [id=EUQEBCSJOQEYO]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.this-cdn-portal will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this-cdn-portal" {
        id                             = "EUQEBCSJOQEYO"
      ~ tags                           = {
          + "environment"            = "demo"
            # (3 unchanged elements hidden)
        }
      ~ tags_all                       = {
          + "environment"            = "demo"
            # (11 unchanged elements hidden)
        }
      + web_acl_id                     = (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_wafv2_web_acl.this-waf-web-acl will be created
  + resource "aws_wafv2_web_acl" "this-waf-web-acl" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "Bot Control waf aws acl"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "caw-aws-aps1-prod-waf_web_acl"
      + scope       = "CLOUDFRONT"
      + tags_all    = {
          + "app-environment" = "Dev"
          + "info-created_by" = "Aayush"
          + "info-purpose"    = "Development"
          + "info-terraform"  = "yes"
          + "org"             = "CAW Studios"
          + "org-cost-center" = "CAW Studios"
          + "org-owner"       = "aayushbajaj505@gmail.com"
          + "org-team"        = "devops"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "AWS-AWSManagedRulesBotControlRuleSet"
          + priority = 0

          + override_action {
              + count {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesBotControlRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWS-AWSManagedRulesBotControlRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "AWS-AWSManagedRulesBotControlRuleSet"
          + sampled_requests_enabled   = true
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

</details>

*Pusher: @AayushbajajCAW, Action: `pull_request`, Working Directory: ``, Workflow: `Plan using Terraform`*